{"chunk_id": "2e7d85ab6c34e2c9", "text": "Using coatings for exterior restoration projects - Construction Specifier Using coatings for exterior restoration projects - Construction Specifier Enter Keyword Section Form+Function Columns Features News Products Videos MasterFormat/UniFormat 00 00 00 Procurement and Contracting Requirements 00 65 36–Warranty Form 01 00 00 General Requirements 02 00 00 Existing Conditions 03 00 00 Concrete 04 00 00 Masonry 05 00 00 Metals 06 00 00 Wood, Plastics, and Composites 07 00 00 Thermal and Moisture Protection 07 24 00 Exterior Insulation and Finish Systems 08 00 00 Openings 09 00 00 Finishes 10 00 00 Specialties 11 00 00 Equipment 12 00 00 Furnishings 13 00 00 Special Construction 14 00 00 Conveying Equipment 21 00 00 Fire Suppression 22 00 00 Plumbing 23 00 00 Heating, Ventilating, and Air Conditioning (HVAC) 25 00 00 Integrated Automation 26 00 00 Electrical 27 00 00 Communications 28 00 00 Electronic Safety and Security 31 00 00 Earthwork 32 00 00 Exterior Improvements 33 00 00 Utilities 34 00 00 Transportation 35 00 00 Waterway and Marine Construction 40 00 00 Process Interconnections 41 00 00 Material Processing and Handling Equipment 42 00 00 Process Heating, Cooling, and Drying Equipment 43 00 00 Process Gas and Liquid Handling, Purification, and Storage Equipment 44 00 00 Pollution and Waste Control Equipment 45 00 00 Industry-Specific Manufacturing Equipment 46 00 00 Water and Wastewater Equipment 48 00 00 Electrical Power Generation 10−Project Description 20−Owner Development 30−Procurement Requirements 40−Contracting Requirements A-Substructure A10−Foundations A20−Subgrade Enclosures A40−Slabs-on-Grade A60−Water"}
{"chunk_id": "d9450e96de9aa79e", "text": "Process Gas and Liquid Handling, Purification, and Storage Equipment 44 00 00 Pollution and Waste Control Equipment 45 00 00 Industry-Specific Manufacturing Equipment 46 00 00 Water and Wastewater Equipment 48 00 00 Electrical Power Generation 10−Project Description 20−Owner Development 30−Procurement Requirements 40−Contracting Requirements A-Substructure A10−Foundations A20−Subgrade Enclosures A40−Slabs-on-Grade A60−Water and Gas Mitigation A90−Substructure-related Activities B-Shell B10−Superstructure B20−Exterior Vertical Enclosures B30−Exterior Horizontal Enclosures C10−Interior Construction C20−Interior Finishes D10−Conveying D20−Plumbing D30−Heating, Ventilation, and Air-conditioning D40−Fire Protection D50?Electrical D6060 - Distributed Communications and Monitoring D60−Communications D70−Electronic Safety and Security D80−Integrated Automation E10−Equipment E20−Furnishings F10−Special Construction F20−Facility Remediation F30−Demolition G10−Site Preparation G20−Site Improvements G30−Liquid and Gas Site Utilities G40−Electrical Site Improvements G50−Site Communications G90−Miscellaneous Site Construction Hospitals Z10−General Requirements Z70−Taxes, Permits, Insurance, and Bonds Z90−Fees and Contingencies Subtopics Home > Features All photos courtesy APV Engineered Coatings by Mike Couchie and Ron Partridge As buildings and structures age, their exteriors can garner a lackluster appearance. Time and environmental conditions take a toll, and what was a once-vibrant exterior becomes faded and degraded. In this situation, owners, architects, and specifiers may be tempted to replace façade materials with new, factory-fresh materials—a costly, time-consuming endeavor. Instead, they should consider an exterior restoration using a field-applied coating. Field-applied exterior coatings can help eliminate the expense and business disruptions associated with removing and replacing structures or façade materials. The right exterior coating could provide the same type of performance associated with its factory-applied counterparts; it can also often be custom color-matched to align a building’s exterior with"}
{"chunk_id": "a92cd6bd2b1b28d7", "text": "coating. Field-applied exterior coatings can help eliminate the expense and business disruptions associated with removing and replacing structures or façade materials. The right exterior coating could provide the same type of performance associated with its factory-applied counterparts; it can also often be custom color-matched to align a building’s exterior with branded or organizational color identities. However, an exterior coating project should not be a quick fix. Careful selection of the right coating system and proper surface preparation techniques make the difference between a long-lasting finish and one that fails in several years. Three questions that need answers before coating selection To ensure the success of any exterior coating project, it is important for project architects and specifiers to be aware of several important details that affect the job itself as well as the performance and longevity of the coating system. The following questions should be part of the Request for Proposal (RFP) and discussion process with prospective contractors bidding on the job. 1. What are the environmental conditions to which the structure is exposed? Sunlight, moisture, temperature extremes, wind, salt-laden coastal air, particulate, chemical pollutants, and abrasion can have a literal impact on a building façade’s coating, drastically breaking it down over time. Chemical agents and free radicals in sunlight, water, and atmospheric pollution can react with a coating’s chemistry and pigment particles, attacking the chemical bonds of the coating’s binder resin. Often, the problem is more than just an aesthetic one—as coatings degrade and erode over time, they can"}
{"chunk_id": "e067b7a556fed155", "text": "down over time. Chemical agents and free radicals in sunlight, water, and atmospheric pollution can react with a coating’s chemistry and pigment particles, attacking the chemical bonds of the coating’s binder resin. Often, the problem is more than just an aesthetic one—as coatings degrade and erode over time, they can take on a chalky consistency in which the coating comes off at even the lightest touch. Eventually, the coating may completely erode, removing the exterior material’s important protective layer and exposing the substrate. The potential results include rusting, pitting, mold/mildew growth, and other problems leading to structural failure if not remedied. Therefore, RFPs should include details on: climate type; humidity; average wind speeds and gust extremes; and ambient chemical and particulate pollutants in the structure’s environment. 2. What is the substrate material? In RFPs, architects and specifiers need to be clear about the type of material to be coated. It is important to ensure the coating selected has been specially formulated to work with the surface or surfaces needing refinishing. A formulation developed for stucco or masonry will likely not work on steel or aluminum surfaces, for example. The condition of the existing coating system indicates whether complete removal or recoating is the best solution. The amount of corrosion or degradation, degree of coating defects on the surface, number of coats, and adhesion between coats are some of the factors that need to be considered before making an overcoat or complete removal decision. Most coatings manufacturers provide information about substrate/coating"}
{"chunk_id": "2be949c5fc7badcf", "text": "recoating is the best solution. The amount of corrosion or degradation, degree of coating defects on the surface, number of coats, and adhesion between coats are some of the factors that need to be considered before making an overcoat or complete removal decision. Most coatings manufacturers provide information about substrate/coating compatibility on their product data sheets or in their field coatings application guides—both of which should be consulted by the project specifier, along with the coating’s SectionFormat specification. These documents provide important information about how to prepare the substrate prior to applying the coating system. It is critical to keep in mind some substrates require more preparation than others. Prior to coating, substrates should be tested using ASTM D3359, Standard Test Method for Measuring Adhesion by Tape Test . Inadequate adhesion will cause the coating to delaminate and fail, eliminating its protective properties. Pages: 1 2 3 Got News? Click here to share your story! 09 96 00—High-performance Coatings B2010.10—Exterior Wall Veneer Coatings Division 09 Exterior FEVE PVDF Restoration national Leave a Comment Comments Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty About Us | Advertise | Contact | Terms and Conditions of Use | Privacy Policy | Cookie Policy | Subscribe Copyright ©2025 Kenilworth Media Inc. All Rights Reserved. Login Lost your password? Don't have an account? Register here Register Sign-up for your account with the Construction Specifier. Your"}
{"chunk_id": "c2d3beffab493e94", "text": "field empty About Us | Advertise | Contact | Terms and Conditions of Use | Privacy Policy | Cookie Policy | Subscribe Copyright ©2025 Kenilworth Media Inc. All Rights Reserved. Login Lost your password? Don't have an account? Register here Register Sign-up for your account with the Construction Specifier. Your account gives you unlimited free access to our e-book Collection, Newsletter Archives and our Digital Editions of the Construction Specifier. Please check the box below to confirm you would like to be added to Kenilworth Media’s various e-mail communications (includes e-newsletters, digital editions of the magazine, a survey now and then, and offers to the design-build industry*). Leave this empty: YES, I CONSENT *We do not sell your e-mail address to 3rd parties, we simply forward their offers to you. Of course, you always have the right to unsubscribe from any communications you receive from us, should you change your mind in the future. Leave this empty: We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of"}
{"chunk_id": "6f253be8a8310e6d", "text": "consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie"}
{"chunk_id": "1cbde94c24facac8", "text": "to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". JSESSIONID session The JSESSIONID cookie is used by New Relic to store a session identifier so that New Relic can monitor session counts for an application. viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description __cf_bm 30 minutes This cookie, set by Cloudflare, is used to support Cloudflare Bot Management. Performance performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description _ga 2 years The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign"}
{"chunk_id": "5f6ceb665ebcf5e2", "text": "the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description _ga 2 years The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors. _gat 1 minute This cookie is installed by Google Universal Analytics to restrain request rate and thus limit the collection of data on high traffic sites. _gat_UA- 1 minute A variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to. _gid 1 day Installed by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously. CONSENT 2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description ADV_u_id 3 months 8 days"}
{"chunk_id": "46a26d7f4e859e6b", "text": "2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description ADV_u_id 3 months 8 days Unique customer identifier used to track unique ad views and interactions with some ads. loc never AddThis sets this geolocation cookie to help understand the location of users who share the information. OAGEO session OpenX sets this cookie to avoid the repeated display of the same ad. OAID 1 year Cookie set to record whether the user has opted out of the collection of information by the AdsWizz Service Cookies. VISITOR_INFO1_LIVE 5 months 27 days A cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface. YSC session YSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages. Others others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Save & Accept"}
