{"chunk_id": "4eda7000ae720f4f", "text": "Quick cure coatings with PMMA/PUMA technology - Construction Specifier Quick cure coatings with PMMA/PUMA technology - Construction Specifier Enter Keyword Section Form+Function Columns Features News Products Videos MasterFormat/UniFormat 00 00 00 Procurement and Contracting Requirements 00 65 36–Warranty Form 01 00 00 General Requirements 02 00 00 Existing Conditions 03 00 00 Concrete 04 00 00 Masonry 05 00 00 Metals 06 00 00 Wood, Plastics, and Composites 07 00 00 Thermal and Moisture Protection 07 24 00 Exterior Insulation and Finish Systems 08 00 00 Openings 09 00 00 Finishes 10 00 00 Specialties 11 00 00 Equipment 12 00 00 Furnishings 13 00 00 Special Construction 14 00 00 Conveying Equipment 21 00 00 Fire Suppression 22 00 00 Plumbing 23 00 00 Heating, Ventilating, and Air Conditioning (HVAC) 25 00 00 Integrated Automation 26 00 00 Electrical 27 00 00 Communications 28 00 00 Electronic Safety and Security 31 00 00 Earthwork 32 00 00 Exterior Improvements 33 00 00 Utilities 34 00 00 Transportation 35 00 00 Waterway and Marine Construction 40 00 00 Process Interconnections 41 00 00 Material Processing and Handling Equipment 42 00 00 Process Heating, Cooling, and Drying Equipment 43 00 00 Process Gas and Liquid Handling, Purification, and Storage Equipment 44 00 00 Pollution and Waste Control Equipment 45 00 00 Industry-Specific Manufacturing Equipment 46 00 00 Water and Wastewater Equipment 48 00 00 Electrical Power Generation 10−Project Description 20−Owner Development 30−Procurement Requirements 40−Contracting Requirements A-Substructure A10−Foundations A20−Subgrade Enclosures A40−Slabs-on-Grade A60−Water"}
{"chunk_id": "f7ce4f99a3ac8a78", "text": "Process Gas and Liquid Handling, Purification, and Storage Equipment 44 00 00 Pollution and Waste Control Equipment 45 00 00 Industry-Specific Manufacturing Equipment 46 00 00 Water and Wastewater Equipment 48 00 00 Electrical Power Generation 10−Project Description 20−Owner Development 30−Procurement Requirements 40−Contracting Requirements A-Substructure A10−Foundations A20−Subgrade Enclosures A40−Slabs-on-Grade A60−Water and Gas Mitigation A90−Substructure-related Activities B-Shell B10−Superstructure B20−Exterior Vertical Enclosures B30−Exterior Horizontal Enclosures C10−Interior Construction C20−Interior Finishes D10−Conveying D20−Plumbing D30−Heating, Ventilation, and Air-conditioning D40−Fire Protection D50?Electrical D6060 - Distributed Communications and Monitoring D60−Communications D70−Electronic Safety and Security D80−Integrated Automation E10−Equipment E20−Furnishings F10−Special Construction F20−Facility Remediation F30−Demolition G10−Site Preparation G20−Site Improvements G30−Liquid and Gas Site Utilities G40−Electrical Site Improvements G50−Site Communications G90−Miscellaneous Site Construction Hospitals Z10−General Requirements Z70−Taxes, Permits, Insurance, and Bonds Z90−Fees and Contingencies Subtopics Home > Features by Stephanie Lengel and Maha Nagra Photos courtesy Tremco Commercial Sealants and Waterproofing Protection of concrete decks, foundations, and other surfaces against damage that is caused by water infiltration, abrasion, and chemicals, can be accomplished with a range of coating and waterproofing technologies. Gaining attention in this space in recent years are polymethyl methacrylate (PMMA) and polyurethane methacrylate (PUMA)-based solutions . For projects with tight timeframes and stringent performance requirements, PMMA/PUMA technology coatings and membranes are appealing due to its ultra-fast cure time, even in extreme weather conditions, and long-term durability. Old is new again The adage holds true for PMMA, a polymer that was initially discovered and commercialized in the 1930s as plexiglass by German chemists seeking to develop safety glass."}
{"chunk_id": "71488fe273d63aba", "text": "coatings and membranes are appealing due to its ultra-fast cure time, even in extreme weather conditions, and long-term durability. Old is new again The adage holds true for PMMA, a polymer that was initially discovered and commercialized in the 1930s as plexiglass by German chemists seeking to develop safety glass. A U.S.-based manufacturer had later produced its own version. PMMAs have been used in a variety of applications for more than 40 years, including acrylic nails, medical technology such as bone cements, musical instruments, and photovoltaic (PV) roof shingles for solar energy consumption. A transparent thermoplastic resin, PMMA offers a cheaper, more environmentally friendly option to polycarbonate. Though often characterized as a new technology in construction, it has been used in roofing since the 1990s in Europe and for the last 12 to 20 years in the United States. It is now gaining recognition across North America for below-grade waterproofing and coating applications. Spiked rollers are used on the thicker layers of a polymethyl methacrylate/polyurethane methacrylate (PMMA/PUMA) coating system to de-train air that may have been created during the mixing process. Differences between PMMA and PUMA Both PUMA and PMMA technologies are rapid curing, meaning full cure in one hour or less after application. They require an activator to catalyze and initiate curing. PUMA and PMMA systems share many characteristics. PUMA is a polyurethane over polymethyl base and offers some advantages over PMMA, most notably its elongation properties and its ability to bridge cracks even at very low temperatures. PUMA"}
{"chunk_id": "36839911b776ba7e", "text": "or less after application. They require an activator to catalyze and initiate curing. PUMA and PMMA systems share many characteristics. PUMA is a polyurethane over polymethyl base and offers some advantages over PMMA, most notably its elongation properties and its ability to bridge cracks even at very low temperatures. PUMA technology coatings can pass ASTM C1305, Standard Test Method for Crack Bridging Ability of Liquid-applied Waterproofing Membranes , with elongation of up to 400 percent at 21 C (70 F) and closer to 300 percent at colder temperatures. With this much elongation, additional reinforcement should be avoided as it prevents the coating from stretching to its full capacity. This is important to note in cases where there is substantial movement, as in climates experiencing extreme temperature fluctuations throughout the seasons. Versatility in construction PMMA/PUMA’s molecular structure makes it suitable for fluid-applied applications in construction. Its bond strength is superior to alternative coating technologies because it is not a superficial adhesive bond, but rather a covalent or chemical bond that involves the sharing of electron pairs between atoms. The formation of bonds at the molecular level occur even when the catalyzed liquid is applied over an existing cured membrane, such as with a lap or tie-in, and is unaffected by the passage of time. This means, for example, a PMMA/PUMA system can be installed in a parking garage and recoated in an hour, or many years later with the same level of cohesive bond. PMMA/PUMA coating systems can be used in"}
{"chunk_id": "1792131d9bc8d87d", "text": "with a lap or tie-in, and is unaffected by the passage of time. This means, for example, a PMMA/PUMA system can be installed in a parking garage and recoated in an hour, or many years later with the same level of cohesive bond. PMMA/PUMA coating systems can be used in pedestrian, under-tile, vehicular, and other heavy-duty, traffic-bearing applications experiencing significant wear and tear such as helipads, parking garages (especially around ticket spitters and turn lanes), bridges, loading docks, garbage, and chemical facilities. It is also used on roofing, balconies, terraces, walkways, plaza decks, planters, and because it can be fully immersed in water, in pools and fountains installed over occupied space. As a cold-applied waterproofing system, the below-grade applications are horizontal split slab and asphalt overlay. Substrates suitable for PMMA/PUMA applications are numerous and include concrete, wood, masonry, gypsum board, and metals such as steel, copper, and aluminum, as well as existing roofing systems, provided the proper testing is completed to verify the roofing system is sound. Pages: 1 2 3 Got News? Click here to share your story! Division 07 Polymethyl methacrylate Polyurethane methacrylate Traffic coatings Waterproofing Leave a Comment Comments Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty About Us | Advertise | Contact | Terms and Conditions of Use | Privacy Policy | Cookie Policy | Subscribe Copyright ©2025 Kenilworth Media Inc. All Rights Reserved. Login Lost"}
{"chunk_id": "56df31f7361d423c", "text": "published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty About Us | Advertise | Contact | Terms and Conditions of Use | Privacy Policy | Cookie Policy | Subscribe Copyright ©2025 Kenilworth Media Inc. All Rights Reserved. Login Lost your password? Don't have an account? Register here Register Sign-up for your account with the Construction Specifier. Your account gives you unlimited free access to our e-book Collection, Newsletter Archives and our Digital Editions of the Construction Specifier. Please check the box below to confirm you would like to be added to Kenilworth Media’s various e-mail communications (includes e-newsletters, digital editions of the magazine, a survey now and then, and offers to the design-build industry*). Leave this empty: YES, I CONSENT *We do not sell your e-mail address to 3rd parties, we simply forward their offers to you. Of course, you always have the right to unsubscribe from any communications you receive from us, should you change your mind in the future. Leave this empty: We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized"}
{"chunk_id": "9245590bcf4edd9c", "text": "consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user"}
{"chunk_id": "28468760cdd1ed66", "text": "category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". JSESSIONID session The JSESSIONID cookie is used by New Relic to store a session identifier so that New Relic can monitor session counts for an application. viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description __cf_bm 30 minutes This cookie, set by Cloudflare, is used to support Cloudflare Bot Management. Performance performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc."}
{"chunk_id": "c2f41c43ad97be6d", "text": "and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description _ga 2 years The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors. _gat 1 minute This cookie is installed by Google Universal Analytics to restrain request rate and thus limit the collection of data on high traffic sites. _gat_UA- 1 minute A variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to. _gid 1 day Installed by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously. CONSENT 2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track"}
{"chunk_id": "2844c9769314f80d", "text": "data that are collected include the number of visitors, their source, and the pages they visit anonymously. CONSENT 2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description ADV_u_id 3 months 8 days Unique customer identifier used to track unique ad views and interactions with some ads. loc never AddThis sets this geolocation cookie to help understand the location of users who share the information. OAGEO session OpenX sets this cookie to avoid the repeated display of the same ad. OAID 1 year Cookie set to record whether the user has opted out of the collection of information by the AdsWizz Service Cookies. VISITOR_INFO1_LIVE 5 months 27 days A cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface. YSC session YSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages. Others others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Save & Accept"}
{"chunk_id": "9fb1db1ed8777915", "text": "into a category as yet. Save & Accept"}
